<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/2ca879d8-f680-4e6a-81a5-23c848f5d521/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/prod_keyserver_cluster/prod_keyserver-service"
      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/prod_keyserver-ecs-scale-application"
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod_keyserver_cluster/prod_keyserver-service"
        name                               = "prod_keyserver-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod_keyserver:14" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod_keyserver:14" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "prod_keyserver" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.o11y.grafana_dashboard.main will be updated in-place
  ~ resource "grafana_dashboard" "main" {
      ~ config_json  = jsonencode(
          ~ {
              ~ panels        = [
                    # (4 unchanged elements hidden)
                    {
                        content     = "# DocumentDB"
                        datasource  = null
                        gridPos     = {
                            h = 4
                            w = 24
                            x = 0
                            y = 16
                        }
                        mode        = "markdown"
                        title       = ""
                        transparent = true
                        type        = "text"
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (10 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (11 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (9 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (10 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (12 unchanged attributes hidden)
                            },
                        ]
                        # (9 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (9 unchanged attributes hidden)
                    },
                ]
                tags          = []
                # (19 unchanged attributes hidden)
            }
        )
        id           = "prod-keyserver"
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place%0A  ~ resource "aws_appautoscaling_target" "ecs_target" {%0A        id                 = "service/prod_keyserver_cluster/prod_keyserver-service"%0A      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/prod_keyserver-ecs-scale-application"%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod_keyserver_cluster/prod_keyserver-service"%0A        name                               = "prod_keyserver-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod_keyserver:14" -> (known after apply)%0A        # (14 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod_keyserver:14" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "prod_keyserver" -> (known after apply)%0A      ~ revision                 = 14 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.o11y.grafana_dashboard.main will be updated in-place%0A  ~ resource "grafana_dashboard" "main" {%0A      ~ config_json  = jsonencode(%0A          ~ {%0A              ~ panels        = [%0A                    # (4 unchanged elements hidden)%0A                    {%0A                        content     = "# DocumentDB"%0A                        datasource  = null%0A                        gridPos     = {%0A                            h = 4%0A                            w = 24%0A                            x = 0%0A                            y = 16%0A                        }%0A                        mode        = "markdown"%0A                        title       = ""%0A                        transparent = true%0A                        type        = "text"%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"%0A                                }%0A                                # (13 unchanged attributes hidden)%0A                            },%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"%0A                                }%0A                                # (13 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (10 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"%0A                                }%0A                                # (13 unchanged attributes hidden)%0A                            },%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"%0A                                }%0A                                # (13 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (11 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"%0A                                }%0A                                # (13 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (9 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"%0A                                }%0A                                # (13 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (10 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"%0A                                }%0A                                # (12 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (9 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"%0A                                }%0A                                # (13 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (9 unchanged attributes hidden)%0A                    },%0A                ]%0A                tags          = []%0A                # (19 unchanged attributes hidden)%0A            }%0A        )%0A        id           = "prod-keyserver"%0A        # (7 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 3 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*